import { Injectable } from '@angular/core';
import { ProductOffer } from '../models/product-offer.model';

@Injectable({
  providedIn: 'root',
})
export class DataService {
  products: ProductOffer[] = [
    new ProductOffer(
      '100002',
      `Технологічне обладнання на 4 програми та кнопка пауза:
      Основне миття ГЕЛЕМ
      Ополіскування помякшеною водою
      Віск з осушенням
      Осмос для надання блиску
      Кнопка "Пауза"`,
      9800
    ),
    new ProductOffer('100009', `Програма піна високий тиск`, 1250),
    new ProductOffer('100010', `Програма піна низький тиск`, 900),
    new ProductOffer('100011', `Щітка`, 900),
    new ProductOffer('100012', `Турбо щітка-піна`, 950),
    new ProductOffer(
      '100013',
      `Комплект обладнання для миття ФУРИ: поворотна консоль з пантографом 5,5м (нержавійка) - 1 робоче місце активне`,
      4500
    ),
    new ProductOffer(
      '100014',
      `Комплект обладнання для миття ФУРИ з пантографом 5,5м (нержавійка) - 1 робоче місце пасивне`,
      4000
    ),
    new ProductOffer('100015', `Компресор`, 800),
    new ProductOffer(
      '100024',
      `Інвертор (частотний перетворювач)
      Система ANTIFROST TURBO ECO Електронна система управління Schneider Germany з 4х рівневою системою захисту для безперебійної роботи обладнання до -35 °С навіть при відсутності електроенергії чи водопостачання. Підключена система для економії води для системи antifrost до 90%.`,
      1200
    ),
    new ProductOffer(
      '100027',
      `Панель оператора TOUCH SCREEN  (сенсорна панель) Schneider Germany 12.1 дюймів з системою SCADA 
      Пульт управління купюроприймач/жетоноприймач`,
      700
    ),
    new ProductOffer('100031', `Система корпоративних карт на пост`, 300),
    new ProductOffer(
      '100033',
      `Апарат з обміну купюр на жетони/монети SAMWASH SMART з нержавіючої сталі в антивандальному виконанні (Купюроприймач CASHCODE (Канада)\ Comastero (Італія) 300/600 купюр, монітор для відображення дії, вікно отримання жетонів)`,
      1500
    ),
    new ProductOffer(
      '100034',
      `Платіжний термінал SAMWASH TOUCHSCREN MONITOR з нержавіючої сталі в антивандальному виконанні (Приймає корпоративні картки лояльності з багаторівневою дисконтною системою, поповнення карт, збереження бонусів, решта на касу, QR CODE, NFC, paypass з доступом до особистого кабінету РРО чеки та інше)`,
      6500
    ),
    new ProductOffer(
      '100035',
      `Платіжний термінал SAMWASH TOUCHSCREN MONITOR з нержавіючої сталі в антивандальному виконанні (платіжний термінал з функцією приймання корпоративних карт лояльностіз багаторівневою дисконтною системою, поповнення карт, збереження бонусів, решта на касу, QR CODE, NFC, paypass з доступом до особистого кабінету РРО чеки та інше)`,
      5500
    ),
    new ProductOffer('100036', `Баки для накопичення води 1 шт, 1м.куб`, 80),
    new ProductOffer('100037', `Жетони 1000 шт`, 500),
    new ProductOffer('100040', `Накриття SMART`, 6200),
    new ProductOffer('100041', `Накриття PIXEL`, 7200),
    new ProductOffer('100042', `Накриття MARCO 1 Banner`, 7700),
    new ProductOffer('100043', `Накриття MARCO 2 Glass`, 8200),
    new ProductOffer('100044', `Накриття MARCHELLO`, 12800),
    new ProductOffer('100044L', `Накриття MARCHELLO Light`, 14000),
    new ProductOffer('100045', `Накриття UFO`, 13500),
    new ProductOffer('100069', `Когутик (реклама на відкритому пості)`, 800),
    new ProductOffer('100047', `Т-подібний відкритий пост для бусів`, 1800),
    new ProductOffer('100048', `П-подібний відкритий пост для бусів`, 2300),
    new ProductOffer(
      '100049',
      `Т-подібний із захистом відкритий пост для бусів`,
      3800
    ),
    new ProductOffer(
      '100050',
      `П-подібний із захистом відкритий пост для бусів`,
      4800
    ),
    new ProductOffer(
      '100051',
      `Відкритий пост для фури, поворотна консоль з пантографом із нержавіючої сталі`,
      3300
    ),
    new ProductOffer(
      '100053',
      `Тримачі для 4 ковриків з гарячого оцинкованого металу на два пости (ширина 2 м)`,
      300
    ),
    new ProductOffer(
      '100054',
      `Тримачі для 4 ковриків з гарячооцинкованого металу на один пост (ширина 2 м) `,
      180
    ),
    new ProductOffer(
      '100055',
      `Тримачі для 4 ковриків з нержавіючої сталі на два пости (ширина 2 м)`,
      420
    ),
    new ProductOffer(
      '100056',
      `Тримачі для 4 ковриків з нержавіючої сталі на один пост (ширина 2 м)`,
      300
    ),
    new ProductOffer(
      '100057',
      `Прищепки (жабки) для ковриків з нержавіючої сталі поширеною базою для надійного кріплення`,
      35
    ),
    new ProductOffer(
      '100059',
      `Пилосос двопостовий трьохфазний з нержавіючої сталі  380 V 6 КвТ  із монітором 17'', системою TOUCH SCREEN: - обдув повітря, - чорніння шин; карта лояльності`,
      6900
    ),
    new ProductOffer('100060', `Рукомийник з нержавіючої сталі, круглий`, 250),
    new ProductOffer(
      '100061',
      `Рукомийник з нержавіючої сталі, прямокутний`,
      380
    ),
    new ProductOffer('100062', `Столик з нержавіючої сталі, двохярусний`, 520),
    new ProductOffer(
      '100063',
      `Індикатор  зайнятих постів, односторонній`,
      300
    ),
    new ProductOffer('100064', `Індикатор зайнятих постів, двосторонній`, 450),
    new ProductOffer('100065', `Індикатор зайнятих постів, однопанельний`, 800),
    new ProductOffer('100066', `Вибивачка ковриків`, 450),
    new ProductOffer('100067', `Урна для сміття`, 180),
    new ProductOffer('100075', `Решітковий настил на закритий пост, 9шт`, 360),
    new ProductOffer('100076', `Решітковий настил на відкритий пост, 4шт`, 140),
    new ProductOffer(
      '100077',
      `Рамки для решіток Н-подібні для закритого поста`,
      205
    ),
    new ProductOffer(
      '100078',
      `Рамки для решіток І-подібні для відкритого поста
      Монтаж `,
      90
    ),
    new ProductOffer(
      '100070',
      `Технічне приміщення з сендвіч панелей, розмір 6*2,4*3`,
      10200
    ),
  ];

  constructor() {}

  getProducts() {
    return this.products;
  }
}
